# 1부: 자바 기술 시스템 소개
- 자바 기술 시스템
- 자바의 과거, 현재
- 자바 가상 머신 제품들
- 자바의 미래
### 실전
- 내 손으로 빌드하는 JDK

# 2부: 자동 메모리 관리
## 자바 메모리 영역 & 메모리 오버플로우
### 런타임 데이터 영역
- 프로그램 카운터
- 자바 가상 머신 스택
- 네이티브 메소드 스택
- 자바 힙
- 메서드 영역
- 런타임 상수 풀
- 다이렉트 메모리

### 핫스팟 가상 머신에서의 객체 보기
- 객체 생성
- 객체의 메모리 레이아웃
- 객체에 접근하기

### 실전
#### outOfMemoryError 예외
- Java heap overflow
- 가상 머신 스택, native 메소드 스택 overflow
- 메서드 영역 overflow
- runtime constant pool overflow
- Native Direct memory overflow

## 가비지 컬렉터, 메모리 할당 전략
### 대상이 죽었는가?
- 참조 카운팅(Reference Counting)
- 도달 가능성 분석(Reachability Analysis)
### 가비지 컬렉션 알고리즘
- 세대 단위 컬렉션
- 마크 앤 스윕(Mark and Sweep)
- 마크 앤 카피
- 마크 앤 컴팩션(Mark and Compaction)

### 핫스팟 알고리즘 상세 구현
- 루트 노드 열거
- 안전 지점
- 안전 지역
- 기억 집합과 카드 테이블
- 쓰기 장벽
- 동시 접근 가능성 분석

### 클래식 가비지 컬렉터
- Serial GC
- Parallel GC
- CMS GC
- G1 GC

# 가상 머신 성능 모니터링과 문제 해결 도구
## 기본 문제 해결 도구
- jps : 자바 프로세스 상태 확인
- jstat : 자바 프로세스 성능 통계 정보 확인
- jinfo : 자바 프로세스 환경 정보 확인
- jmap : 자바 프로세스 메모리 힙 덤프 생성
- jhat : 힙 덤프 분석
- jstack : 자바 프로세스 스레드 덤프 생성
- jcmd : 자바 프로세스 진단 명령어 실행

## GUI 문제 해결 도구
- jconsole : 자바 프로세스 모니터링 GUI 도구
- VisualVM : 자바 프로세스 모니터링 및 문제 해결 GUI 도구

## 핫스팟 가상 머신 플러그인 & 도구
- HSDIS
- JITWatch

# 최적화 사례 분석 & 실전
## 자바 성능 최적화 사례 분석
- 대용량 메모리 기기 대상 배포 전략
- 클러스터 간 동기화로 인한 메모리 오버플로우
- 힙 메모리 부족으로 인한 메모리 오버플로우
- 시스템을 느리게 만드는 외부 명령어
- 서버 가상 머신 프로세스 비정상 종료
- 부적절한 데이터 구조로 인한 메모리 과소비
- 윈도우 가상 메모리로 인한 긴 일시 정지
- 안전 지점으로 인한 긴 일시 정지

# 3부: 가상 머신 실행 서브 시스템
## 클래스 파일 구조
- 매직 넘버와 클래스 파일의 버전
- 상수 풀
- 접근 플래그
- 클래스 인덱스, 부모 클래스 인덱스, 인터페이스 인덱스
- 필드 정보
- 메서드 테이블
- 속성 테이블
### 바이트 코드 명령어
- 로드, 스토어
- 산술 연산
- 형 변환
- 객체 생성, 접근 명령어
- 피연산자 스택 관리 명령어
- 제어 흐름 명령어
- 메서드 호출과 반환 명령어
- 예외 처리 명령어
- 동기화 명령어

## 클래스 로딩 메커니즘
- 클래스 로딩 시점
- 클래스 로딩 처리 과정
- 클래스 로더
- 자바 모듈 시스템


## 바이트 코드 실행 엔진
### 런타임 스택 프레임 구조
- 지역 변수 테이블
- 피연산자 스택
- 동적 링크
- 반환 주소
